ezois_ka/oooezoiskaobmen/src/InformationRegisters/ДоговорыУчастниковКонтролируемыхСделок/ДоговорыУчастниковКонтролируемыхСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорыУчастниковКонтролируемыхСделок</name>
  <resources>
    <name>КодНаименованияСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияЦеныСделки</name>
    <type>
      <types>CatalogRef.СпособыОпределенияЦенКонтролируемыхСделок</types>
    </type>
  </resources>
  <resources>
    <name>КодУсловийПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СделкаОблагаетсяЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтороныПрименяютРазныеСтавкиПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СделкаОтноситсяКДеятельностиНовогоМорскогоМесторождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СделкаОтноситсяКДеятельностиОблагаемойНалогомНаДопДоход</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СделкаНеЯвляетсяКонтролируемойПоП4</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/ДоговорыУчастниковКонтролируемыхСделок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Записывает дополнительные сведения о договоре контролируемой сделки.
//	Параметры:
//		СтруктураИзмерений - Структура - см. ИнициализироватьСтруктуруИзмерений();
//		ДопСведения - Структура - см. ИнициализироватьДопСведенияДоговоров().
//
Процедура СохранитьДопСведенияДоговоров(СтруктураИзмерений, ДопСведения) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок");
		Для каждого ЭлементИзмерения Из СтруктураИзмерений Цикл
			ЭлементБлокировки.УстановитьЗначение(ЭлементИзмерения.Ключ, ЭлементИзмерения.Значение);
		КонецЦикла;
		Блокировка.Заблокировать();
		
		ЗаписьДопСведений = РегистрыСведений.ДоговорыУчастниковКонтролируемыхСделок.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(ЗаписьДопСведений, СтруктураИзмерений);
		ЗаполнитьЗначенияСвойств(ЗаписьДопСведений, ДопСведения);
		ЗаписьДопСведений.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИмяСобытия = НСтр("ru = 'Запись дополнительных сведений договоров участников контролируемых сделок'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, ЗаписьДопСведений.Метаданные(), , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает структура измерений регистра.
//	Возвращаемое значение:
//		Структура:
//			* Организация - СправочникСсылка.Организации - организация указанная в договоре;
//			* Контрагент - СправочникСсылка.Контрагенты, СправочникСсылка.Организации - контрагент указаннай в договоре, в случае интеркомпани - организация;
//			* ДоговорКонтрагента - СправочникСсылка.ДоговорыКонтрагентов, СправочникСсылка.ДоговорыМеждуОрганизациями, СправочникСсылка.ДоговорыАренды, СправочникСсылка.ДоговорыКредитовИДепозитов
//				- договор для которого определяются дополнительные реквизиты.
//
Функция ИнициализироватьСтруктуруИзмерений() Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	СтруктураВозврата.Вставить("Контрагент", Неопределено);
	СтруктураВозврата.Вставить("ДоговорКонтрагента", Неопределено);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает структура дополнительных сведений по договору, которые применяются для заполнения уведомления о контролируемых сделках.
//	Возвращаемое значение:
//		Структура:
//			* КодНаименованияСделки - Строка - см. макет Обработки.ПомощникПодготовкиУведомленияОКонтролируемыхСделках.КонтролируемыеСделкиСпискиКодов, область "ТипИСтороныДоговора";
//			* СпособОпределенияЦеныСделки - СправочникСсылка.СпособыОпределенияЦенКонтролируемыхСделок - способ определения цены сделки;
//			* КодУсловийПоставки - Строка - см. макет Обработки.ПомощникПодготовкиУведомленияОКонтролируемыхСделках.КонтролируемыеСделкиСпискиКодов, область "КодУсловийПоставки";
//			* СтороныПрименяютРазныеСтавкиПоНалогуНаПрибыль - Булево - признак отличия налогообложения между участниками контролируемой сделки;
//			* СделкаОтноситсяКДеятельностиНовогоМорскогоМесторождения - Булево - Сделка относится к деятельности нового морского месторождения;
//			* СделкаОтноситсяКДеятельностиОблагаемойНалогомНаДопДоход - Булево - Сделка относится к деятельности облагаемой налогом на дополнительный доход от добычи углеводородного сырья;
//
Функция ИнициализироватьДопСведенияДоговоров() Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("КодНаименованияСделки");
	СтруктураВозврата.Вставить("СпособОпределенияЦеныСделки");
	СтруктураВозврата.Вставить("КодУсловийПоставки");
	СтруктураВозврата.Вставить("СтороныПрименяютРазныеСтавкиПоНалогуНаПрибыль");
	СтруктураВозврата.Вставить("СделкаОтноситсяКДеятельностиНовогоМорскогоМесторождения");
	СтруктураВозврата.Вставить("СделкаОтноситсяКДеятельностиОблагаемойНалогомНаДопДоход");
	СтруктураВозврата.Вставить("СделкаНеЯвляетсяКонтролируемойПоП4");
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#КонецЕсли
